v13/burningCylinder/burningCylinder2D_H2Air/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver            ode;
}

chemistry           on;

initialChemicalTimeStep 1e-08;

EulerImplicitCoeffs
{
    cTauChem        1;
}

odeCoeffs
{
    solver          seulex; //Rosenbrock34;
    absTol          1e-10;
    relTol          1e-6; //0.01;
}

#include "reactions"

// ************************************************************************* //
