v13/burningCylinder/burningCylinder2D_H2Air/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


numberOfSubdomains 6;

// method          hierarchical;

// hierarchicalCoeffs
// {
//     n      (2 2 1);
//     order  xyz;
// }

method          scotch;

// method             simple;

// simpleCoeffs
// {
//     n              (4 1 1);
// }

// ************************************************************************* //
