v13/burningCylinder/burningCylinder2D_H2Air/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;

sourceCase "$FOAM_CASE";

sourcePatches (minZ);
exposedPatchName maxZ;

extrudeModel        linearNormal;

nLayers             1;

linearNormalCoeffs
{
    thickness       0.1;
}

flipNormals false;
mergeFaces false;  

// Merge small edges. Fraction of bounding box.
//mergeTol 0;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
