v13/burningCylinder/burningCylinder2D_H2Air/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    // default         Euler;
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    // div(phi,U)      Gauss limitedLinearV 1;
    // div(phid,p)     Gauss limitedLinear 1;
    // div(phi,Yi_h)   Gauss limitedLinear 1;
    // div(phi,K)      Gauss limitedLinear 1;

    // div(phi,U)      Gauss upwind;
    // div(phid,p)     Gauss upwind;
    // div(phi,Yi_h)   Gauss upwind;
    // div(phi,K)      Gauss upwind;

    div(phi,U)      Gauss vanLeerV;
    div(phid,p)     Gauss vanLeer;
    div(phi,Yi_h)   Gauss vanLeer;
    div(phi,K)      Gauss linear;

    // div(phi,Yi_h)   Gauss multivariateSelection
    // {
    //     air             limitedLinear01 1;
    //     H2O             limitedLinear01 1;
    //     h               limitedLinear 1;
    // };
    
    div(phi,epsilon) Gauss limitedLinear 1;
    div(phi,k) Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
